function Header() {
    return (
     <section class="hero is-success is-halfheight">
    <div class="hero-body">
      <div class="">
        <p class="title">
          ジブリ作品紹介
        </p>
        <p class="subtitle">
          
        </p>
      </div>
    </div>
  </section>
    );
  }
  
  function Image(props) {
    return (
      <div className="card">
        <div className="card-image">
          <figure className="image">
          <img src={props.src} alt="giburi" />
          </figure>
        </div>
      </div>
    );
  }
  
  function Gallery(props) {
    const { urls } = props;
    return (
      <div className="columns is-vcentered is-multiline">
        {urls.map((url) => {
          return (
            <div key={url} className="column is-3">
              <Image src={url} />
            </div>
          );
        })}
      </div>
    );
  }
  
  function Main() {
    const urls = [
      " https://image.tmdb.org/t/p/w600_and_h900_bestv2/npOnzAbLh6VOIu3naU5QaEcTepo.jpg",
      "https://image.tmdb.org/t/p/w600_and_h900_bestv2/qG3RYlIVpTYclR9TYIsy8p7m7AT.jpg",
      "https://image.tmdb.org/t/p/w600_and_h900_bestv2/rtGDOeG9LzoerkDGZF9dnVeLppL.jpg",
      "https://image.tmdb.org/t/p/w600_and_h900_bestv2/7nO5DUMnGUuXrA4r2h6ESOKQRrx.jpg",
      "https://image.tmdb.org/t/p/w600_and_h900_bestv2/xjJU6rwzLX7Jk8HFQfVW6H5guMC.jpg",
      "https://image.tmdb.org/t/p/w600_and_h900_bestv2/byKAndF6KQSDpGxp1mTr23jPbYp.jpg",
      "https://image.tmdb.org/t/p/w600_and_h900_bestv2/jHWmNr7m544fJ8eItsfNk8fs2Ed.jpg",
      "https://image.tmdb.org/t/p/w600_and_h900_bestv2/avPMO5cnaGHgLaNiAIhy33WoQLm.jpg",
      "https://image.tmdb.org/t/p/w600_and_h900_bestv2/mikKSEdk5kLhflWXbp4S5mmHsDo.jpg",
      "https://image.tmdb.org/t/p/w600_and_h900_bestv2/oc2OB2KDmSRDMelKEAA1n4YRQL0.jpg",
      "https://image.tmdb.org/t/p/w600_and_h900_bestv2/39wmItIWsg5sZMyRUHLkWBcuVCM.jpg",
      "https://image.tmdb.org/t/p/w600_and_h900_bestv2/rRLYX4RZIyloHSJwvZKAhphAjiB.jpg",
    ];
    return (
      <main>
        <section className="section">
          <div className="container">
          <Gallery urls={urls} />
          </div>
        </section>
      </main>
    );
  }
  
  
  
  function Footer() {
    return (
      <footer className="footer">
        <div className="content has-text-centered">
          <p>Studio Ghibli images are retrieved from Studio Ghibli API</p>
          <p>
            <a href="https://ghibliapi.herokuapp.com/">Studio Ghibli API</a>
          </p>
        </div>
      </footer>
    );
  }
     function Contents(){
       return(
        <div>

<p>     
             -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
             
          </p>
          
          <h1 className="title">天空の城ラピュタ</h1>
          
          <p>スラッグ峡谷に住む見習い機械工の少年パズーは、ある日、空から降ってきた不思議な少女を助ける。その少女シータは、浮力を持つ鉱石「飛行石」を身につけていた。そしてその不思議な石を手に入れようと、政府機関や海賊たちが迫ってくる。バズーとシータは飛行石をめぐる陰謀に巻き込まれ、やがて「ラピュタ帝国」にいざなわれてゆく。それは天空に浮かび、かつて地上を支配したという伝説の島だった。</p>

           <p>     
             -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
             
          </p>
     
          <h2 className="title">火垂るの墓</h2>
          <p>昭和20年、神戸、14歳の少年と4歳の妹は、空襲で母が入院することになり、叔母のもとに身を寄せる。やがて母が死ぬと、叔母は兄妹を邪険に扱うようになり、2人は家を出ることにする。誰もいない防空壕で、新たな生活を始める子供たち。しかし、そこには厳しい現実が待っていた…。昭和20年、神戸、14歳の少年と4歳の妹は、空襲で母が入院することになり、叔母のもとに身を寄せる。やがて母が死ぬと、叔母は兄妹を邪険に扱うようになり、2人は家を出ることにする。誰もいない防空壕で、新たな生活を始める子供たち。しかし、そこには厳しい現実が待っていた…。</p>
          <p>     
             -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
             
          </p>
          <h3 className="title">となりのトトロ</h3>
         <p>昭和30年代。大学で考古学を研究する学者の父に連れられて、小学6年生のサツキ、4歳のメイは田舎に引っ越し、豊かな自然と美しい四季があふれる環境で、3人が暮らし始めたのは、お化け屋敷のような一軒家。そして、その家には不思議な生き物が住んでいた…。</p>
          <p>     
             -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
             
          </p>
          <h4 className="title">魔女の宅急便</h4>
<p>スラッグ峡谷に住む見習い機械工の少年パズーは、ある日、空から降ってきた不思議な少女を助ける。その少女シータは、浮力を持つ鉱石「飛行石」を身につけていた。そしてその不思議な石を手に入れようと、政府機関や海賊たちが迫ってくる。バズーとシータは飛行石をめぐる陰謀に巻き込まれ、やがて「ラピュタ帝国」にいざなわれてゆく。それは天空に浮かび、かつて地上を支配したという伝説の島だった…。</p>
<p>     
             -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
             
          </p>
          <h5 className="title">おもいでぽろぽろ</h5>
          <p>東京でひとり暮らしをしている27歳の会社員・タエ子。農業に興味を持っている彼女は、休暇を利用し、農家を営む義兄がいる山形へと向かう。寝台列車で揺れる中、彼女は田舎がないことで寂しい思いをした小学5年生の自分を思い出す。そんな思い出と共に過ごしていくうち、次第にタエ子は農家の人々の暮らしに強い魅力を感じるようになる…</p>
          <p>     
             -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
             
          </p>
          <h6 className="title">紅の豚</h6>
<p>1920年代のイタリアを背景に、呪いを受けて"豚"となった中年パイロットの活躍を描く。森山周一郎がシブい声で扮する主人公・ポルコ・ロッソのダンディズムが光る秀作。飛行艇同士によるダイナミックな空中戦や、宮崎自身ファンである各機の細やかな設定も見どころ。飛行艇を操る空賊が横行していた、第一次大戦後のイタリアはアドリア海。賞金稼ぎの飛行艇乗りであるポルコ・ロッソは、空賊たちには天敵の存在。自分の顔を魔法で豚に変えてしまったポルコを何とかやっつけたいと一計を案じた空賊たちは、アメリカからスゴ腕の飛行艇乗りを呼び寄せ、彼に一騎打ちを迫る…。</p>

<p>     
             -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
             
          </p>
          <h7 className="title">もののけ姫</h7>
          <p> 自然と人間の関係をテーマとし続けてきた作品で、山里に住む若者アシタカは、怒りと憎しみによりタタリ神と化した猪神から呪いをかけられてしまう。呪いを解く術を求めて旅に出るアシタカはやがて、西方の地でタタラの村にたどり着く。エボシ御前が率いるその村では、鉄を造り続けていたが、同時にそれは神々の住む森を破壊することでもあった。そして、そんなタタラ達に戦いを挑むサンの存在をアシタカは知る。人の子でありながら山犬に育てられた彼女はもののけ姫と呼ばれていた......。</p>

          <p>     
             -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
             
          </p>
          <h8 className="title">猫の恩返し</h8>
         <p>ごく普通の女子高校生ハル。学校には遅刻するし、ゴミ箱の中身をぶちまける大失態。おまけに、憧れの男の子が別の女の子といい感じで2ショットになっているのを目撃してしまい、すっかり落ち込んでいた。そんなハルは、たまたまトラックにひかれそうになった1匹の猫を助けた。しかし、その猫が実は"猫の国"の王子ルーンだったことから、ハルはお礼として猫の国へと招待される。そこでハルは猫たちから盛大な歓迎を受け、いつしか"つらい現実より、猫になって楽しく生きたい"と願うようになる。と、そこへ猫の男爵バロンが現われるのだった…。    </p>
         <p>     
             -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
             
          </p>
          <h9 className="title">崖の上のポニョ</h9>
      <p>海辺の小さな町で崖の上の一軒家に暮らす少年・宗介は、ある日、海岸で頭がジャムの瓶にはまり困っていた魚の女の子・ポニョを助け出す。ポニョはクラゲに乗って家出してきたところだった。それ以来、宗介とポニョの間には絆が芽生えていくが、彼らが住むそれぞれの世界には、大きな隔たりがあった。</p>

      <p>     
             -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
             
          </p>

          <h10 className="title">借りぐらしのアリエッティ</h10>
          <p>両親と３人で静かなくらしを営む14歳の小人の少女アリエッティ。彼らは、郊外の広大な古い屋敷の床下に住み、一家の生活に必要な物を床上に住む人間に気づかれないようにこっそり借りてきて生活するという「借りぐらし」をしている。彼らには人間に姿を見られてはいけないという掟があり、もし見られたなら、そこから引っ越さなければならなかった。ところが、ある夏の日、アリエッティは、病気療養のためにやって来た12歳の少年・翔にその姿を見られてしまう。</p>
        
          <p>     
             -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
             
          </p>
          <h11 className="title">千と千尋</h11>

<p>両親と共に引越し先の新しい家へ向かう10歳の少女、千尋。しかし彼女はこれから始まる新しい生活に大きな不安を感じていた。やがて千尋たちの乗る車はいつの間にか不思議の町へと迷い込んでしまう。その奇妙な町の珍しさにつられ、どんどん足を踏み入れていく両親。が、彼らは不思議の町の掟を破ったために豚にされてしまい......。巨匠・宮崎駿監督が前作「もののけ姫」とは対照的に、現代日本を舞台に少女の成長と友愛の物語を描く、自分探しの冒険ファンタジー。</p>

<p>     
             -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
             
          </p>

          <h12 className="title">ココリコ坂から</h12>

<p>1963年の横浜。16歳の少女・海が通う高校では、文化部の部室棟、通称「カルチェラタン」が取り壊されようとしていた。そんなある日、施設取り壊しをめぐる反対運動に巻き込まれた海は、そこで1学年上の新聞部長・俊と出会う。</p>

<p>     
             -----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
             
          </p>

          <p>日本大学文理学部情報科学科 Webプログラミングの演習課題</p>
            <p>5420048 浅井良太</p>


        </div>





       )
     }


  function App() {
      return (
        <div>
          <Header />
      
          <Main />
         <Contents />
        
            <Footer />



            
        </div>
        
      );
  }
  
  export default App;